t=0:0.001:120;%生成的波形，横坐标也就是时间从0开始，到10结束，点与点的间隔为0.001。t就是相当于一个数组，[0.001, 0.002, 0.003,..., 9.998, 9.999, 10.000]
% A=2;
% f=130;
% T=1/f;
% B=0.25*T;
A=0.1;    %振幅mA
f=10;    %频率Hz
T=1/f;
B=0.5*T;   %波宽ms
% B=0.05;   %波宽ms
y=A*XYR_H(sin(2*pi*f*t)).*(1-XYR_H(sin(2*pi*f*(t+B))));
%y=A*((square(2*pi*f*t,25)+1)/2);

plot(t, y, 'k','linewidth',3);%画出以数组t为横坐标，数组f为纵坐标组成的点，并用线将这些点连起来，线的宽度为2
set(gca,'FontSize',20 ,'ytick',[]);
axis([0,1, 0, 0.1]);%设置X坐标的显示范围为[-0.1,1.2],Y坐标的显示范围为[-2,3]，注意只有写在plot函数之后才会生效
